vwitti/stm32n6_demo_psram/submodules/STM32CubeN6_V1.3.0/Projects/STM32N6570-DK/Applications/VENC/VENC_RTSP_Server/Appli/Core/Src/stm32n6570_discovery_audio_multi.c
        /* Configure the SAI clock according to the requested audio frequency if not already done by other instances */
        if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
        {
          if (MX_SAI1_ClockConfig(&haudio_in_sai, AudioInit->SampleRate) != HAL_OK)
          {
            ret = BSP_ERROR_CLOCK_FAILURE;
          }
        }

        if (ret == BSP_ERROR_NONE)
        {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
          SAI_MspInit(&haudio_in_sai);
          if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
          {
            SAI_MspInit(&haudio_out_sai);
          }
#else /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
          /* Register the default SAI MSP callbacks */
          if (Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
          {
            if (BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
          }
          if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
          {
            if (Audio_Out_Ctx[0].IsMspCallbacksValid == 0U)
            {
              if (BSP_AUDIO_OUT_RegisterDefaultMspCallbacks(0) != BSP_ERROR_NONE)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
        }

        if (ret == BSP_ERROR_NONE)
        {
          MX_SAI_Config_t mx_config;

          /* Prepare haudio_in_sai handle */
          mx_config.AudioFrequency        = Audio_In_Ctx[Instance].SampleRate;
          mx_config.AudioMode             = SAI_MODESLAVE_RX;
          mx_config.ClockStrobing         = SAI_CLOCKSTROBING_FALLINGEDGE;
          mx_config.MonoStereoMode        = SAI_MONOMODE;
          mx_config.DataSize              = SAI_DATASIZE_16;
          mx_config.FrameLength           = 32;
          mx_config.ActiveFrameLength     = 16;
          mx_config.OutputDrive           = SAI_OUTPUTDRIVE_ENABLE;
          mx_config.Synchro               = SAI_SYNCHRONOUS;
          mx_config.SynchroExt            = SAI_SYNCEXT_DISABLE;
          mx_config.SlotActive            = SAI_SLOTACTIVE_0;

          if (MX_SAI1_Init(&haudio_in_sai, &mx_config) != HAL_OK)
          {
            /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
          else
          {
            if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
            {
              /* Prepare haudio_out_sai handle */
              mx_config.AudioMode         = SAI_MODEMASTER_TX;
              mx_config.Synchro           = SAI_ASYNCHRONOUS;
              mx_config.SlotActive        = SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1;

              Audio_Out_Ctx[0].BitsPerSample = AUDIO_RESOLUTION_16B;

              if (MX_SAI1_Init(&haudio_out_sai, &mx_config) != HAL_OK)
              {
                /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
          if (ret == BSP_ERROR_NONE)
          {
            /* Register SAI TC, HT and Error callbacks */
            if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_COMPLETE_CB_ID, SAI_RxCpltCallback) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_RX_HALFCOMPLETE_CB_ID, SAI_RxHalfCpltCallback)
                     != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
            else
            {
              if (HAL_SAI_RegisterCallback(&haudio_in_sai, HAL_SAI_ERROR_CB_ID, SAI_ErrorCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
            }
          }
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
          if (ret == BSP_ERROR_NONE)
          {
            /* Initialize audio codec */
#if defined(USE_AUDIO_CODEC_WM8904)
            WM8904_Init_t codec_init;
            codec_init.InputDevice  = WM8904_IN_MIC1;
            codec_init.OutputDevice = (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) ? WM8904_OUT_NONE :
                                      WM8904_OUT_HEADPHONE;
            codec_init.Resolution   = WM8904_RESOLUTION_16B; /* Not used */
#else /* USE_AUDIO_CODEC_WM8904 */
            CS42L51_Init_t codec_init;
            codec_init.InputDevice  = CS42L51_IN_MIC1;
            codec_init.OutputDevice = (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET) ? CS42L51_OUT_NONE :
                                      CS42L51_OUT_HEADPHONE;
            codec_init.Resolution   = CS42L51_RESOLUTION_16B; /* Not used */
#endif /* USE_AUDIO_CODEC_WM8904 */
            codec_init.Frequency    = AudioInit->SampleRate;
            codec_init.Volume       = AudioInit->Volume;

            /* Initialize the codec internal registers */
            if (Audio_Drv->Init(Audio_CompObj, &codec_init) < 0)
            {
              ret = BSP_ERROR_COMPONENT_FAILURE;
            }
            else
            {
              /* Update audio in context state */
              Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
            }
          }
        }
      }
    }
    else /* (Instance == 1U) */
    {
      /* Set MDF instances */
      haudio_in_mdf_multi[0].Instance = MDF1_Filter0;

      /* Configure MDF clock according to the requested audio frequency */
      if (MX_MDF1_ClockConfig(&haudio_in_mdf_multi[0], AudioInit->SampleRate) != HAL_OK)
      {
        ret = BSP_ERROR_CLOCK_FAILURE;
      }
      else
      {
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 0)
        MDF_MspInit(&haudio_in_mdf_multi[0]);
#else /* (USE_HAL_MDF_REGISTER_CALLBACKS == 0) */
        /* Register the MDF MSP Callbacks */
        if (Audio_In_Ctx[Instance].IsMspCallbacksValid == 0U)
        {
          if(BSP_AUDIO_IN_RegisterDefaultMspCallbacks(Instance) != BSP_ERROR_NONE)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
        if (ret == BSP_ERROR_NONE)
        {
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 0) */
          uint32_t maxFilterNumber = 0;
          for (uint16_t channel = 0;channel < AudioInit->ChannelsNbr; channel++)
          {
            maxFilterNumber = max(maxFilterNumber, filter_number_per_channel[channel]);
          }
          
          for (uint16_t channel = 0;channel < AudioInit->ChannelsNbr; channel++)
          {
            /* Prepare MDF peripheral initialization */
            MX_MDF_Config_t mxMdfInit;
            mxMdfInit.Gain               = MDF_GAIN(AudioInit->SampleRate);
            mxMdfInit.DecimationRatio    = MDF_DECIMATION_RATIO(AudioInit->SampleRate);
            mxMdfInit.CicMode            = MDF_CIC_MODE(AudioInit->SampleRate);
            mxMdfInit.ProcClockDivider   = MDF_PROC_CLOCK_DIVIDER(AudioInit->SampleRate);
            mxMdfInit.OutputClockDivider = MDF_OUTPUT_CLOCK_DIVIDER(AudioInit->SampleRate);
            
            /* Instantiate filter number and filter input for each channel*/
            haudio_in_mdf_multi[channel].Instance = filter_per_channel[channel];
            haudio_in_mdf_multi[channel].Init.FilterBistream = bitstream_per_channel[channel];
            
            /* Configure interleaved output*/ 
            haudio_in_mdf_multi[channel].Init.CommonParam.InterleavedFilters = maxFilterNumber;
            
