vwitti/stm32n6_demo_psram/submodules/STM32CubeN6_V1.3.0/Projects/STM32N6570-DK/Applications/VENC/VENC_RTSP_Server/Appli/Core/Src/stm32n6570_discovery_audio_multi.c
            if (MX_MDF1_Init(&haudio_in_mdf_multi[channel], &mxMdfInit) != HAL_OK)
            {
              ret = BSP_ERROR_PERIPH_FAILURE;
            }
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
            if (ret == BSP_ERROR_NONE)
            {
              /* Register MDF filter TC, HT and Error callbacks */
              if (HAL_MDF_RegisterCallback(&haudio_in_mdf_multi[channel], HAL_MDF_ACQ_COMPLETE_CB_ID, MDF_AcqCpltCallback) != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else if (HAL_MDF_RegisterCallback(&haudio_in_mdf_multi[channel], HAL_MDF_ACQ_HALFCOMPLETE_CB_ID, MDF_AcqHalfCpltCallback)
                       != HAL_OK)
              {
                ret = BSP_ERROR_PERIPH_FAILURE;
              }
              else
              {
                if (HAL_MDF_RegisterCallback(&haudio_in_mdf_multi[channel], HAL_MDF_ERROR_CB_ID, MDF_ErrorCallback) != HAL_OK)
                {
                  ret = BSP_ERROR_PERIPH_FAILURE;
                }
              }
            }
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
          }
          if (ret == BSP_ERROR_NONE)
          {
#ifdef DK_REVB
            /* Start SITF5 - which is connected to PE12 = second mics Data line on DK_REVB.*/
            MDF1_Filter5->SITFCR = 0U;
            MDF1_Filter5->SITFCR |=  ((31U << MDF_SITFCR_STH_Pos) | MDF_SITF_NORMAL_SPI_MODE | MDF_SITF_CCK0_SOURCE);
            MDF1_Filter5->SITFCR |= MDF_SITFCR_SITFEN;
#endif
            /* Update audio in context state */
            Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_STOP;
          }
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
        }
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 1) */
      }
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Deinit the audio IN peripherals.
  * @param  Instance  AUDIO IN Instance. It can be 0 when SAI is used or 1 if MDF is used.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_IN_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if (Instance >= AUDIO_IN_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_RESET)
  {
    if (Instance == 0U)
    {
      /* SAI peripheral de-initialization */
      if (HAL_SAI_DeInit(&haudio_in_sai) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      /* De-initialize audio codec if not currently used by audio out instance 0 */
      else
      {
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 0)
        SAI_MspDeInit(&haudio_in_sai);
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 0) */
        if (Audio_Out_Ctx[0].State == AUDIO_OUT_STATE_RESET)
        {
          if (Audio_Drv->DeInit(Audio_CompObj) < 0)
          {
            ret = BSP_ERROR_COMPONENT_FAILURE;
          }
#if defined(USE_AUDIO_CODEC_CS42L51)
          else
          {
            (void)CS42L51_PowerDown();
          }
#endif /* USE_AUDIO_CODEC_CS42L51 */
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        /* Update audio in context */
        Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RESET;
      }
    }
    else /* (Instance == 1U) */
    {
      /* MDF peripheral de-initialization */
      if (HAL_MDF_DeInit(&haudio_in_mdf_multi[0]) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
      else
      {
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 0)
        MDF_MspDeInit(&haudio_in_mdf_multi[0]);
#endif /* (USE_HAL_MDF_REGISTER_CALLBACKS == 0) */
      }

      if (ret == BSP_ERROR_NONE)
      {
        /* Update audio in context */
        Audio_In_Ctx[Instance].State = AUDIO_IN_STATE_RESET;
      }
    }
  }
  else
  {
    /* Nothing to do */
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Start audio recording.
  * @param  Instance Audio in instance.
  * @param  pBuf Pointer on data buffer.
  * @param  NbrOfBytes Size of buffer in bytes. Maximum size is 65535 bytes.
  * @retval BSP status.
  */
int32_t BSP_AUDIO_IN_Record(uint32_t Instance, uint8_t *pBuf, uint32_t NbrOfBytes)
{
  int32_t ret = BSP_ERROR_NONE;

  if ((Instance >= AUDIO_IN_INSTANCES_NBR) || (pBuf == NULL))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check the internal buffer size */
  else if ((Instance == 1U) && ((NbrOfBytes / 2U) > DEFAULT_AUDIO_IN_BUFFER_SIZE))
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  /* Check audio in state */
  else if (Audio_In_Ctx[Instance].State != AUDIO_IN_STATE_STOP)
  {
    ret = BSP_ERROR_BUSY;
  }
  else
  {
    if (Instance == 0U)
    {
      /* If no playback is on going, transmit some bytes to generate SAI clock and synchro signals */
      if ((Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_PLAYING) && (Audio_Out_Ctx[0].State != AUDIO_OUT_STATE_PAUSE))
      {
        uint8_t TxData[2] = {0x00U, 0x00U};
        if (HAL_SAI_Transmit(&haudio_out_sai, TxData, 2, 1000) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }

      if (ret == BSP_ERROR_NONE)
      {
        /* Call the audio Codec Play function */
        if (Audio_Drv->Play(Audio_CompObj) < 0)
        {
          ret = BSP_ERROR_COMPONENT_FAILURE;
        }
        else
        {
          /* Initiate a DMA transfer of audio samples from the serial audio interface */
          /* Because only 16 bits per sample is supported, DMA transfer is in halfword size */
          if (HAL_SAI_Receive_DMA(&haudio_in_sai, (uint8_t *) pBuf, (uint16_t) NbrOfBytes / 2U) != HAL_OK)
          {
            ret = BSP_ERROR_PERIPH_FAILURE;
          }
        }
      }
    }
    else /* Instance = 1 */
    {
      MDF_DmaConfigTypeDef dmaConfig;

      Audio_In_Ctx[Instance].pBuff = pBuf;
      Audio_In_Ctx[Instance].Size  = NbrOfBytes;

      /* Call the MDF acquisition start function */
      dmaConfig.Address    = (uint32_t) Audio_DigMicRecBuff;
      dmaConfig.DataLength = 2U*NbrOfBytes;
      dmaConfig.MsbOnly    = DISABLE;

      //SCB_CleanInvalidateDCache (); //[DSe] [TBF]
      
      /* Start Main channel with DMA*/
      if (HAL_MDF_AcqStart_DMA(&haudio_in_mdf_multi[0], &Audio_MdfFilterConfig, &dmaConfig) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
            
      /* Start Interleaved channels*/
      for (uint16_t channel = 1;channel <  Audio_In_Ctx[Instance].ChannelsNbr; channel++)
      {
        if (HAL_MDF_AcqStart(&haudio_in_mdf_multi[channel], &Audio_MdfFilterConfig) != HAL_OK)
        {
          ret = BSP_ERROR_PERIPH_FAILURE;
        }
      }
      
      
