vwitti/stm32n6_demo_psram/submodules/STM32CubeN6_V1.3.0/Projects/STM32N6570-DK/Applications/VENC/VENC_RTSP_Server/Appli/Core/Src/stm32n6570_discovery_audio_multi.c
  /* This function is called when an Interrupt due to transfer error on or peripheral
     error occurs. */
}

/**
  * @brief  MDF1 clock Config.
  * @param  hmdf MDF handle.
  * @param  SampleRate Audio sample rate used to record the audio stream.
  * @retval HAL status.
  */
__weak HAL_StatusTypeDef MX_MDF1_ClockConfig(MDF_HandleTypeDef *hmdf, uint32_t SampleRate)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);

  HAL_StatusTypeDef         status = HAL_OK;
  RCC_OscInitTypeDef        RCC_OscInitStruct;
  RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_ON;
  //RCC_OscInitStruct.PLL4.PLLSource = RCC_PLLSOURCE_HSE;
  // USe HSI for starting immediately after STBY
  RCC_OscInitStruct.PLL4.PLLSource = RCC_PLLSOURCE_HSI; 
  RCC_OscInitStruct.PLL4.PLLFractional = 0;
  //RCC_OscInitStruct.PLL4.PLLM = 6;  /* 48/6 = 8MHz */
  RCC_OscInitStruct.PLL4.PLLM = 8;  /* 64/8 = 8MHz */
  if ((SampleRate == AUDIO_FREQUENCY_11K) || (SampleRate == AUDIO_FREQUENCY_22K) || (SampleRate == AUDIO_FREQUENCY_44K))
  {
    RCC_OscInitStruct.PLL4.PLLN = 192; /* 8*192 = 1536MHz */
    RCC_OscInitStruct.PLL4.PLLP1 = 4;
    RCC_OscInitStruct.PLL4.PLLP2 = 2; /* 1536/8 = 192 MHZ */
  }
  else if (SampleRate == AUDIO_FREQUENCY_96K)
  {
    RCC_OscInitStruct.PLL4.PLLN = 172; /* 8*172 = 1376MHz */
    RCC_OscInitStruct.PLL4.PLLP1 = 2;
    RCC_OscInitStruct.PLL4.PLLP2 = 1; /* 1376/2 = 688MHz */
  }
  else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_32K, AUDIO_FREQUENCY_48K */
  {
    RCC_OscInitStruct.PLL4.PLLN = 172; /* 8*172 = 1376MHz */
    RCC_OscInitStruct.PLL4.PLLP1 = 7;
    RCC_OscInitStruct.PLL4.PLLP2 = 4; /* 1376/28 = 49.142MHz */
  }
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    status = HAL_ERROR;
  }

  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_MDF1;
  PeriphClkInitStruct.Mdf1ClockSelection = RCC_MDF1CLKSOURCE_IC8;
  PeriphClkInitStruct.ICSelection[RCC_IC8].ClockSelection = RCC_ICCLKSOURCE_PLL4;
  if ((SampleRate == AUDIO_FREQUENCY_11K) || (SampleRate == AUDIO_FREQUENCY_22K) || (SampleRate == AUDIO_FREQUENCY_44K))
  {
    PeriphClkInitStruct.ICSelection[RCC_IC8].ClockDivider = 17;
  }
  else if (SampleRate == AUDIO_FREQUENCY_96K)
  {
    PeriphClkInitStruct.ICSelection[RCC_IC8].ClockDivider = 7;
  }
  else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_32K, AUDIO_FREQUENCY_48K */
  {
    PeriphClkInitStruct.ICSelection[RCC_IC8].ClockDivider = 1;
  }
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    status = HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Initialize MDF1.
  * @param  hmdf  MDF handle.
  * @param  MXInit MDF configuration structure.
  * @retval HAL_status.
  */
__weak HAL_StatusTypeDef MX_MDF1_Init(MDF_HandleTypeDef *hmdf, MX_MDF_Config_t *MXInit)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* MDF peripheral initialization */
  hmdf->Init.CommonParam.ProcClockDivider = MXInit->ProcClockDivider;
  hmdf->Init.CommonParam.OutputClock.Activation = ENABLE;
  hmdf->Init.CommonParam.OutputClock.Pins = MDF_OUTPUT_CLOCK_0;
  hmdf->Init.CommonParam.OutputClock.Divider = MXInit->OutputClockDivider;
  hmdf->Init.CommonParam.OutputClock.Trigger.Activation = DISABLE;
  hmdf->Init.SerialInterface.Activation = ENABLE;
  hmdf->Init.SerialInterface.Mode = MDF_SITF_NORMAL_SPI_MODE;
  hmdf->Init.SerialInterface.ClockSource = MDF_SITF_CCK0_SOURCE;
  hmdf->Init.SerialInterface.Threshold = 31U;

  if (HAL_MDF_Init(hmdf) != HAL_OK)
  {
    status = HAL_ERROR;
  }

  /* Prepare MDF filter configuration parameters */
  Audio_MdfFilterConfig.DataSource                = MDF_DATA_SOURCE_BSMX;
  Audio_MdfFilterConfig.Delay                     = 0U;
  Audio_MdfFilterConfig.CicMode                   = MXInit->CicMode;
  Audio_MdfFilterConfig.DecimationRatio           = MXInit->DecimationRatio;
  Audio_MdfFilterConfig.Offset                    = 0;
  Audio_MdfFilterConfig.Gain                      = MXInit->Gain;
  Audio_MdfFilterConfig.ReshapeFilter.Activation  = ENABLE;
  Audio_MdfFilterConfig.ReshapeFilter.DecimationRatio = MDF_RSF_DECIMATION_RATIO_4;

  Audio_MdfFilterConfig.HighPassFilter.Activation = ENABLE;
  Audio_MdfFilterConfig.HighPassFilter.CutOffFrequency = MDF_HPF_CUTOFF_0_000625FPCM;

  Audio_MdfFilterConfig.Integrator.Activation     = DISABLE;

  Audio_MdfFilterConfig.AcquisitionMode           = MDF_MODE_ASYNC_CONT;
  Audio_MdfFilterConfig.FifoThreshold             = MDF_FIFO_THRESHOLD_NOT_EMPTY;
  Audio_MdfFilterConfig.DiscardSamples            = 0U;

  return status;
}
/**
  * @}
  */

/** @defgroup STM32N6570_DISCOVERY_AUDIO_IN_Private_Functions AUDIO IN Private Functions
  * @{
  */
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
/**
  * @brief  Half reception complete callback.
  * @param  hsai SAI handle.
  * @retval None.
  */
static void SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  BSP_AUDIO_IN_HalfTransfer_CallBack(0);
}

/**
  * @brief  Reception complete callback.
  * @param  hsai SAI handle.
  * @retval None.
  */
static void SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  BSP_AUDIO_IN_TransferComplete_CallBack(0);
}
#else /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */
/**
  * @brief  Half reception complete callback.
  * @param  hsai SAI handle.
  * @retval None.
  */
void HAL_SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  BSP_AUDIO_IN_HalfTransfer_CallBack(0);
}

/**
  * @brief  Reception complete callback.
  * @param  hsai SAI handle.
  * @retval None.
  */
void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsai);

  BSP_AUDIO_IN_TransferComplete_CallBack(0);
}
#endif /* (USE_HAL_SAI_REGISTER_CALLBACKS == 1) */

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
/**
  * @brief  MDF acquisition complete callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
static void MDF_AcqCpltCallback(MDF_HandleTypeDef *hmdf)
{
  uint32_t     index;
  uint32_t     recbufsize = Audio_In_Ctx[1].Size / 2U;
  __IO int32_t tmp;

  UNUSED(hmdf);

