vwitti/stm32n6_demo_psram/submodules/STM32CubeN6_V1.3.0/Projects/STM32N6570-DK/Applications/VENC/VENC_RTSP_Server/Appli/Core/Src/stm32n6570_discovery_audio_multi.c
    /* DMA linked list init */
    if (HAL_DMAEx_List_Init(&hDmaSaiRx) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(0);
    }

    /* Link SAI queue to DMA channel */
    if (HAL_DMAEx_List_LinkQ(&hDmaSaiRx, &SAIRxQueue) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(0);
    }

    /* Associate the DMA handle */
    __HAL_LINKDMA(hsai, hdmarx, hDmaSaiRx);

    /* SAI DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(AUDIO_IN_SAI_DMA_IRQ, BSP_AUDIO_IN_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(AUDIO_IN_SAI_DMA_IRQ);
  }
}

/**
  * @brief  Deinitializes SAI MSP.
  * @param  hsai  SAI handle
  * @retval HAL status
  */
static void SAI_MspDeInit(SAI_HandleTypeDef *hsai)
{
  if (hsai->Instance == AUDIO_OUT_SAI)
  {
    /* Disable SAI DMA Channel IRQ */
    HAL_NVIC_DisableIRQ(AUDIO_OUT_SAI_DMA_IRQ);

    /* Reset the DMA Channel configuration*/
    if (HAL_DMAEx_List_DeInit(&hDmaSaiTx) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* Reset TxQueue */
    if (HAL_DMAEx_List_ResetQ(&SAITxQueue) != HAL_OK)
    {
      BSP_AUDIO_OUT_Error_CallBack(0);
    }

    /* De-initialize FS, SCK, MCK and SD pins */
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_FS_GPIO_PORT, AUDIO_OUT_SAI_FS_PIN);
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_SCK_GPIO_PORT, AUDIO_OUT_SAI_SCK_PIN);
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_SD_GPIO_PORT, AUDIO_OUT_SAI_SD_PIN);
    HAL_GPIO_DeInit(AUDIO_OUT_SAI_MCLK_GPIO_PORT, AUDIO_OUT_SAI_MCLK_PIN);
  }
  if (hsai->Instance == AUDIO_IN_SAI)
  {
    /* Disable SAI DMA Channel IRQ */
    HAL_NVIC_DisableIRQ(AUDIO_IN_SAI_DMA_IRQ);

    /* Reset the DMA Channel configuration*/
    if (HAL_DMAEx_List_DeInit(&hDmaSaiRx) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(0);
    }

    /* Reset RxQueue */
    if (HAL_DMAEx_List_ResetQ(&SAIRxQueue) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(0);
    }

    /* De-initialize SD pin */
    HAL_GPIO_DeInit(AUDIO_IN_SAI_SD_GPIO_PORT, AUDIO_IN_SAI_SD_PIN);

    /* Disable SAI clock */
    AUDIO_IN_SAI_CLK_DISABLE();
  }
}

/**
  * @brief  Initialize MDF MSP.
  * @param  hmdf handle.
  * @retval None.
  */
static void MDF_MspInit(MDF_HandleTypeDef *hmdf)
{
  GPIO_InitTypeDef           GPIO_InitStruct;
  static DMA_NodeTypeDef     RxNode;
  static DMA_NodeConfTypeDef dmaNodeConfig;

  /* Enable MDF1 clock */
  AUDIO_MDF1_CLK_ENABLE();

  /* MDF pins configuration: DATIN0, DATAIN5 and CCK0 pins */
  AUDIO_MDF1_DATIN0_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = AUDIO_MDF1_DATIN0_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_MDF1_DATIN0_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_MDF1_DATIN0_GPIO_PORT, &GPIO_InitStruct);

  /* REVB Board : Init DATIN5 = mics #3 and #4 input*/
  
  AUDIO_MDF1_DATIN5_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = AUDIO_MDF1_DATIN5_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_MDF1_DATIN5_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_MDF1_DATIN5_GPIO_PORT, &GPIO_InitStruct);

  
  AUDIO_MDF1_CCK0_GPIO_CLK_ENABLE();
  GPIO_InitStruct.Alternate = AUDIO_MDF1_CCK0_GPIO_AF;
  GPIO_InitStruct.Pin       = AUDIO_MDF1_CCK0_GPIO_PIN;
  HAL_GPIO_Init(AUDIO_MDF1_CCK0_GPIO_PORT, &GPIO_InitStruct);

  /* DMA configuration */
  if (MdfRxQueue.Head == NULL)
  {
    AUDIO_IN_MDF1_DMA_CLK_ENABLE();

    hDmaMdf.Instance = AUDIO_IN_MDF1_DMA_CHANNEL;

    /* Set node type */
    dmaNodeConfig.NodeType                            = DMA_GPDMA_LINEAR_NODE;
    /* Set common node parameters */
    dmaNodeConfig.Init.Request                        = AUDIO_IN_MDF1_DMA_REQUEST;
    dmaNodeConfig.Init.BlkHWRequest                   = DMA_BREQ_SINGLE_BURST;
    dmaNodeConfig.Init.Direction                      = DMA_PERIPH_TO_MEMORY;
    dmaNodeConfig.Init.SrcInc                         = DMA_SINC_FIXED;
    dmaNodeConfig.Init.DestInc                        = DMA_DINC_INCREMENTED;
    dmaNodeConfig.Init.SrcDataWidth                   = DMA_SRC_DATAWIDTH_WORD;
    dmaNodeConfig.Init.DestDataWidth                  = DMA_DEST_DATAWIDTH_WORD;
    dmaNodeConfig.Init.SrcBurstLength                 = 1;
    dmaNodeConfig.Init.DestBurstLength                = 1;
    dmaNodeConfig.Init.Priority                       = DMA_HIGH_PRIORITY;
    dmaNodeConfig.Init.TransferEventMode              = DMA_TCEM_BLOCK_TRANSFER;
    dmaNodeConfig.Init.TransferAllocatedPort          = DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
    /* Set node data handling parameters */
    dmaNodeConfig.DataHandlingConfig.DataExchange     = DMA_EXCHANGE_NONE;
    dmaNodeConfig.DataHandlingConfig.DataAlignment    = DMA_DATA_RIGHTALIGN_ZEROPADDED;
    /* Set node trigger parameters */
    dmaNodeConfig.TriggerConfig.TriggerPolarity       = DMA_TRIG_POLARITY_MASKED;
    dmaNodeConfig.SrcSecure                           = DMA_CHANNEL_SRC_SEC;
    dmaNodeConfig.DestSecure                          = DMA_CHANNEL_DEST_SEC;

    if (HAL_DMA_ConfigChannelAttributes(&hDmaMdf, DMA_CHANNEL_SEC) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Build NodeRx */
    if (HAL_DMAEx_List_BuildNode(&dmaNodeConfig, &RxNode) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Insert NodeRx to ADF queue */
    if (HAL_DMAEx_List_InsertNode_Tail(&MdfRxQueue, &RxNode) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Set queue circular mode for ADF queue */
    if (HAL_DMAEx_List_SetCircularMode(&MdfRxQueue) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    hDmaMdf.InitLinkedList.Priority          = DMA_HIGH_PRIORITY;
    hDmaMdf.InitLinkedList.LinkStepMode      = DMA_LSM_FULL_EXECUTION;
    hDmaMdf.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT1;
    hDmaMdf.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
    hDmaMdf.InitLinkedList.LinkedListMode    = DMA_LINKEDLIST_CIRCULAR;

    /* DMA linked list init */
    if (HAL_DMAEx_List_Init(&hDmaMdf) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Link MDF queue to DMA channel */
    if (HAL_DMAEx_List_LinkQ(&hDmaMdf, &MdfRxQueue) != HAL_OK)
    {
      BSP_AUDIO_IN_Error_CallBack(1);
    }

    /* Associate the DMA handle */
    __HAL_LINKDMA(hmdf, hdma, hDmaMdf);

    /* MDF DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority(AUDIO_IN_MDF1_DMA_IRQ, BSP_AUDIO_OUT_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(AUDIO_IN_MDF1_DMA_IRQ);
  }
}

/**
  * @brief  DeInitialize MDF MSP.
  * @param  hmdf MDF handle.
  * @retval None.
  */
static void MDF_MspDeInit(MDF_HandleTypeDef *hmdf)
{
  UNUSED(hmdf);

  /* Disable MDF DMA Channel IRQ */
  HAL_NVIC_DisableIRQ(AUDIO_IN_MDF1_DMA_IRQ);

  /* Reset the DMA Channel configuration*/
  if (HAL_DMAEx_List_DeInit(&hDmaMdf) != HAL_OK)
  {
    BSP_AUDIO_IN_Error_CallBack(1);
  }

  /* Reset RxQueue */
  if (HAL_DMAEx_List_ResetQ(&MdfRxQueue) != HAL_OK)
  {
    BSP_AUDIO_IN_Error_CallBack(1);
  }

  /* De-initialize DATIN0 and CCK0 pins */
  HAL_GPIO_DeInit(AUDIO_MDF1_DATIN0_GPIO_PORT, AUDIO_MDF1_DATIN0_GPIO_PIN);
  HAL_GPIO_DeInit(AUDIO_MDF1_CCK0_GPIO_PORT, AUDIO_MDF1_CCK0_GPIO_PIN);

  /* Disable MDF clock */
  AUDIO_MDF1_CLK_DISABLE();
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
